In [137]:
import pandas as pd

# SERIES

In [138]:
#to make series

In [139]:
s = pd.Series(["Ali","Hamza","Zeeshan","Faiz","Adnan","Sabir"])
s

0        Ali
1      Hamza
2    Zeeshan
3       Faiz
4      Adnan
5      Sabir
dtype: object

In [140]:
Products = pd.Series(["Rio","Prince","Sooper","Gala","Chocolato","Oreo","Rite"])
Products

0          Rio
1       Prince
2       Sooper
3         Gala
4    Chocolato
5         Oreo
6         Rite
dtype: object

In [141]:
Subjects = pd.Series(["Urdu","Islamiat","Physics","Chemistry","Zoology","Botany"])
Subjects

0         Urdu
1     Islamiat
2      Physics
3    Chemistry
4      Zoology
5       Botany
dtype: object

In [142]:
#lable/ indexing values from series

In [143]:
Subjects[4]

'Zoology'

In [144]:
Products[3]

'Gala'

In [145]:
s[5]

'Sabir'

In [146]:
#for multiple indexing

In [147]:
Products[[0,3]]

0     Rio
3    Gala
dtype: object

In [148]:
Subjects[[1,4,2,3]]

1     Islamiat
4      Zoology
2      Physics
3    Chemistry
dtype: object

In [149]:
s[[1,4]]

1    Hamza
4    Adnan
dtype: object

In [150]:
#updating or inserting values in series

In [151]:
s[6]="Imad" #Inserted.But"Multiple values cannot be inserteed"

In [152]:
s

0        Ali
1      Hamza
2    Zeeshan
3       Faiz
4      Adnan
5      Sabir
6       Imad
dtype: object

In [153]:
s[5]="Ahsan" #Updated
s

0        Ali
1      Hamza
2    Zeeshan
3       Faiz
4      Adnan
5      Ahsan
6       Imad
dtype: object

In [154]:
#to update Multiple values

In [155]:
s[[3,0]]=["Ikram","Nawaz"]
s

0      Nawaz
1      Hamza
2    Zeeshan
3      Ikram
4      Adnan
5      Ahsan
6       Imad
dtype: object

In [156]:
# to delete value from series

In [157]:
del s[3]

In [158]:
s

0      Nawaz
1      Hamza
2    Zeeshan
4      Adnan
5      Ahsan
6       Imad
dtype: object

In [159]:
#multiple values cannot be deleted

In [160]:
#you can also give your index as you want.i.e

In [161]:
s1 = pd.Series([100,200,400,500,300],index=["mango","banana","apple","orange","grapes"])
s1

mango     100
banana    200
apple     400
orange    500
grapes    300
dtype: int64

# lets create series by using dictionary

In [162]:
Student = {"Name":"A.Muqeet","FatherName":"Nasir","roll.No":"15"} 
Student

{'Name': 'A.Muqeet', 'FatherName': 'Nasir', 'roll.No': '15'}

In [163]:
s2 = pd.Series(Student)
s2

Name          A.Muqeet
FatherName       Nasir
roll.No             15
dtype: object

In [164]:
s3 = pd.Series(s1, index=["mango","banana","apple","orange","grapes","Blue Berry"]) #here you can see Blue Berry is not in 
                                                                                    #index of s1,
                                                                                    #but when we put it,the value its value
                                                                                    #is shown NAN,means it is empty or Null.
s3

mango         100.0
banana        200.0
apple         400.0
orange        500.0
grapes        300.0
Blue Berry      NaN
dtype: float64

In [165]:
#you can update value of Blue  Berry in s3

In [166]:
s3["Blue Berry"]="150"
s3

mango         100.0
banana        200.0
apple         400.0
orange        500.0
grapes        300.0
Blue Berry    150.0
dtype: float64

In [167]:
s3.values #by default the values is shown in float.

array([100., 200., 400., 500., 300., 150.])

In [168]:
s3.index #for index

Index(['mango', 'banana', 'apple', 'orange', 'grapes', 'Blue Berry'], dtype='object')

In [169]:
#for Boolean indexing

In [170]:
s3>200

mango         False
banana        False
apple          True
orange         True
grapes         True
Blue Berry    False
dtype: bool

In [171]:
s3[s3>200]

apple     400.0
orange    500.0
grapes    300.0
dtype: float64

In [172]:
#to find index which is available in your series or not.i.e

In [173]:
"pine apple" in s3

False

In [174]:
"mango" in s3

True

In [175]:
pd.notnull(s3) #to find non null values

mango         True
banana        True
apple         True
orange        True
grapes        True
Blue Berry    True
dtype: bool

In [176]:
#to update index of seies

In [177]:
s4 = pd.Series(s3.values,index=["a","b","c",33,"d","e"])
s4

a     100.0
b     200.0
c     400.0
33    500.0
d     300.0
e     150.0
dtype: float64

# DATA FRAME

In [178]:
df = pd.DataFrame([123,234,345,456,567]) #to create data frame

In [179]:
df

     0
0  123
1  234
2  345
3  456
4  567

In [180]:
#here also you can put your own index.i.e

In [184]:
ab = pd.DataFrame(["red","green","blue","black","orange"],index=['c1','c2','c3','c4','c5'])
ab

         0
c1     red
c2   green
c3    blue
c4   black
c5  orange

In [185]:
#you can also give the name of column

In [186]:
ab = pd.DataFrame(["red","green","blue","black","orange"],index=['c1','c2','c3','c4','c5'],columns=["colors"])
ab

    colors
c1     red
c2   green
c3    blue
c4   black
c5  orange

# lets create data frame in dictionary

In [187]:
marks = {"Maths":[77,65,55,45,67,48,36,70,58,61],
         "English":[64,66,58,41,71,45,65,59,68,44],
         "Physics":[65,65,75,46,55,64,64,38,66,57],
         "Chemistry":[46,76,57,46,65,81,35,45,56,65]}
marks

{'Maths': [77, 65, 55, 45, 67, 48, 36, 70, 58, 61],
 'English': [64, 66, 58, 41, 71, 45, 65, 59, 68, 44],
 'Physics': [65, 65, 75, 46, 55, 64, 64, 38, 66, 57],
 'Chemistry': [46, 76, 57, 46, 65, 81, 35, 45, 56, 65]}

In [188]:
d1 = pd.DataFrame(marks,index=["ALi","Nawaz","Hamza","Malik","Zain","Adil","Bilal","Faiz","Shakir","Ahsan"])

In [189]:
d1

        Maths  English  Physics  Chemistry
ALi        77       64       65         46
Nawaz      65       66       65         76
Hamza      55       58       75         57
Malik      45       41       46         46
Zain       67       71       55         65
Adil       48       45       64         81
Bilal      36       65       64         35
Faiz       70       59       38         45
Shakir     58       68       66         56
Ahsan      61       44       57         65

In [190]:
#if you have excel file then the you can use this code
#data = pd.read_cvs("file name")

In [191]:
#to find values from data frame

In [192]:
d1.head()#it will show first five values

       Maths  English  Physics  Chemistry
ALi       77       64       65         46
Nawaz     65       66       65         76
Hamza     55       58       75         57
Malik     45       41       46         46
Zain      67       71       55         65

In [193]:
d1.head(4)# or put no. of data you want

       Maths  English  Physics  Chemistry
ALi       77       64       65         46
Nawaz     65       66       65         76
Hamza     55       58       75         57
Malik     45       41       46         46

In [194]:
d1.tail()  #it will show last five values

        Maths  English  Physics  Chemistry
Adil       48       45       64         81
Bilal      36       65       64         35
Faiz       70       59       38         45
Shakir     58       68       66         56
Ahsan      61       44       57         65

In [195]:
d1.tail(4) # or put no. of data you want

        Maths  English  Physics  Chemistry
Bilal      36       65       64         35
Faiz       70       59       38         45
Shakir     58       68       66         56
Ahsan      61       44       57         65

In [196]:
#for information about data frame

In [197]:
d1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, ALi to Ahsan
Data columns (total 4 columns):
Maths        10 non-null int64
English      10 non-null int64
Physics      10 non-null int64
Chemistry    10 non-null int64
dtypes: int64(4)
memory usage: 400.0+ bytes

In [198]:
d1.describe()  #it will decribe your frame i.e.counting,mean,standard daviation,minimum value,maximum value,etc

           Maths    English    Physics  Chemistry
count  10.000000  10.000000  10.000000  10.000000
mean   58.200000  58.100000  59.500000  57.200000
std    12.497111  10.918384  10.824355  14.665151
min    36.000000  41.000000  38.000000  35.000000
25%    49.750000  48.250000  55.500000  46.000000
50%    59.500000  61.500000  64.000000  56.500000
75%    66.500000  65.750000  65.000000  65.000000
max    77.000000  71.000000  75.000000  81.000000

In [199]:
d1.Chemistry #for information of only one index

ALi       46
Nawaz     76
Hamza     57
Malik     46
Zain      65
Adil      81
Bilal     35
Faiz      45
Shakir    56
Ahsan     65
Name: Chemistry, dtype: int64

In [ ]:
#if there is space in the name of index,then use this code
#d1["name of index"]

In [200]:
#for information of more then one index

In [204]:
d1[["Chemistry","Maths"]]

        Chemistry  Maths
ALi            46     77
Nawaz          76     65
Hamza          57     55
Malik          46     45
Zain           65     67
Adil           81     48
Bilal          35     36
Faiz           45     70
Shakir         56     58
Ahsan          65     61

In [205]:
#for complete information of one student

In [209]:
d1.loc[["Faiz"]]

      Maths  English  Physics  Chemistry
Faiz     70       59       38         45

In [210]:
d1.loc["Faiz"]

Maths        70
English      59
Physics      38
Chemistry    45
Name: Faiz, dtype: int64

In [207]:
#for complete information if multi students

In [208]:
d1.loc[["Adil","Bilal"]]

       Maths  English  Physics  Chemistry
Adil      48       45       64         81
Bilal     36       65       64         35

In [ ]:
#for information of one subject of multi students

In [213]:
d1.loc[["Adil","Bilal"]]["Maths"]

Adil     48
Bilal    36
Name: Maths, dtype: int64

In [218]:
d1.loc[["Adil","Bilal"]][["Maths"]]

       Maths
Adil      48
Bilal     36

In [215]:
d1.loc["Hamza"]["English"]    #for info of one sub of one student

58

In [216]:
d1.loc[["Hamza"]]["English"]

Hamza    58
Name: English, dtype: int64

In [217]:
d1.loc[["Hamza"]][["English"]]

       English
Hamza       58

In [219]:
#you can put more values in frame.i.e

In [221]:
d1["Practicle"]=[12,14,9,15,11,13,8,10,12,14]

In [222]:
d1

        Maths  English  Physics  Chemistry  Practicle
ALi        77       64       65         46         12
Nawaz      65       66       65         76         14
Hamza      55       58       75         57          9
Malik      45       41       46         46         15
Zain       67       71       55         65         11
Adil       48       45       64         81         13
Bilal      36       65       64         35          8
Faiz       70       59       38         45         10
Shakir     58       68       66         56         12
Ahsan      61       44       57         65         14

In [224]:
#you can also delete index

In [225]:
del d1["Practicle"]

In [226]:
d1

        Maths  English  Physics  Chemistry
ALi        77       64       65         46
Nawaz      65       66       65         76
Hamza      55       58       75         57
Malik      45       41       46         46
Zain       67       71       55         65
Adil       48       45       64         81
Bilal      36       65       64         35
Faiz       70       59       38         45
Shakir     58       68       66         56
Ahsan      61       44       57         65

In [227]:
#to add the marks of students

In [232]:
d1["total"]=d1["Maths"]+ d1["English"]+ d1["Physics"]+ d1["Chemistry"]

In [233]:
d1

        Maths  English  Physics  Chemistry  total
ALi        77       64       65         46    252
Nawaz      65       66       65         76    272
Hamza      55       58       75         57    245
Malik      45       41       46         46    178
Zain       67       71       55         65    258
Adil       48       45       64         81    238
Bilal      36       65       64         35    200
Faiz       70       59       38         45    212
Shakir     58       68       66         56    248
Ahsan      61       44       57         65    227

In [235]:
d1["total"]

ALi       252
Nawaz     272
Hamza     245
Malik     178
Zain      258
Adil      238
Bilal     200
Faiz      212
Shakir    248
Ahsan     227
Name: total, dtype: int64

In [236]:
d1[["total"]]

        total
ALi       252
Nawaz     272
Hamza     245
Malik     178
Zain      258
Adil      238
Bilal     200
Faiz      212
Shakir    248
Ahsan     227

In [237]:
#how to get which student is pass or fail..??
#lets try to find it

In [238]:
d1["Status"] = d1["total"]>200

In [239]:
d1

        Maths  English  Physics  Chemistry  total  Status
ALi        77       64       65         46    252    True
Nawaz      65       66       65         76    272    True
Hamza      55       58       75         57    245    True
Malik      45       41       46         46    178   False
Zain       67       71       55         65    258    True
Adil       48       45       64         81    238    True
Bilal      36       65       64         35    200   False
Faiz       70       59       38         45    212    True
Shakir     58       68       66         56    248    True
Ahsan      61       44       57         65    227    True

In [240]:
#above it is showing true and false but you want to give status of pass and fail,so...

In [242]:
import numpy as np  # becouse where is the key of numpy

In [248]:
d1["Status"]=np.where((d1["total"]>=200),"Pass","Fail")

In [249]:
d1

        Maths  English  Physics  Chemistry  total Status
ALi        77       64       65         46    252   Pass
Nawaz      65       66       65         76    272   Pass
Hamza      55       58       75         57    245   Pass
Malik      45       41       46         46    178   Fail
Zain       67       71       55         65    258   Pass
Adil       48       45       64         81    238   Pass
Bilal      36       65       64         35    200   Pass
Faiz       70       59       38         45    212   Pass
Shakir     58       68       66         56    248   Pass
Ahsan      61       44       57         65    227   Pass

In [250]:
#or you can also do like that

In [251]:
d1["Status"]=["Pass"if marks>=200 else "Fail"for marks in d1["total"]]

In [252]:
d1

        Maths  English  Physics  Chemistry  total Status
ALi        77       64       65         46    252   Pass
Nawaz      65       66       65         76    272   Pass
Hamza      55       58       75         57    245   Pass
Malik      45       41       46         46    178   Fail
Zain       67       71       55         65    258   Pass
Adil       48       45       64         81    238   Pass
Bilal      36       65       64         35    200   Pass
Faiz       70       59       38         45    212   Pass
Shakir     58       68       66         56    248   Pass
Ahsan      61       44       57         65    227   Pass

In [253]:
#but some students got less then 40 marks in some subjects,as they are fail,but they are shown passed. So...??

In [255]:
d1["RevisedStatus"]=np.where(((d1["Maths"]>=40) & (d1["English"]>=40) & (d1["Physics"]>=40) & (d1["Chemistry"]>=40)),"Pass","Fail")

In [256]:
d1

        Maths  English  Physics  Chemistry  total Status RevisedStatus
ALi        77       64       65         46    252   Pass          Pass
Nawaz      65       66       65         76    272   Pass          Pass
Hamza      55       58       75         57    245   Pass          Pass
Malik      45       41       46         46    178   Fail          Pass
Zain       67       71       55         65    258   Pass          Pass
Adil       48       45       64         81    238   Pass          Pass
Bilal      36       65       64         35    200   Pass          Fail
Faiz       70       59       38         45    212   Pass          Fail
Shakir     58       68       66         56    248   Pass          Pass
Ahsan      61       44       57         65    227   Pass          Pass

In [257]:
#be careful using brackets and during writing code..
#now lets give them new status

In [259]:
d1["NewStatus"]=["Pass" if (math>=40) & (eng>=40) & (phy>=40) & (chem>=40) else "Fail" for math,eng,phy,chem in zip(d1["Maths"],d1["English"],d1["Physics"],d1["Chemistry"])]

In [260]:
d1

,Maths,English,Physics,Chemistry,total,Status,RevisedStatus,NewStatus
ALi,77,64,65,46,252,Pass,Pass,Pass
Nawaz,65,66,65,76,272,Pass,Pass,Pass
Hamza,55,58,75,57,245,Pass,Pass,Pass
Malik,45,41,46,46,178,Fail,Pass,Pass
Zain,67,71,55,65,258,Pass,Pass,Pass
Adil,48,45,64,81,238,Pass,Pass,Pass
Bilal,36,65,64,35,200,Pass,Fail,Fail
Faiz,70,59,38,45,212,Pass,Fail,Fail
Shakir,58,68,66,56,248,Pass,Pass,Pass
Ahsan,61,44,57,65,227,Pass,Pass,Pass